import os
#----------------------------------------------------------------------------------------------------------------------------------------
def Amount_of_elements_in_constant_regions (FileName) :
    try:
        if os.stat(FileName).st_size > 0: #РїСЂРѕРІРµСЂРєР° РЅР° РЅРµРїСѓСЃС‚РѕС‚Сѓ С„Р°Р№Р»Р°
            f=open(FileName,'r')
            n=0 #СЃС‡РµС‚С‡РёРє СЌР»РµРјРµРЅС‚Р°, РєРѕС‚РѕСЂС‹Р№ СЃС‡РёС‚С‹РІР°РµРј
            count=0 #СЃС‡РµС‚С‡РёРє РєРѕР»-РІР° СЌР»РµРјРµРЅС‚РѕРІ РІ РїРѕСЃС‚РѕСЏРЅРЅС‹С… СѓС‡Р°СЃС‚РєР°С… РїРѕСЃР»РµРґРѕРІР°С‚РµР»СЊРЅРѕСЃС‚Рё
            region=0 #РёРґРµРЅС‚РёС„РёРєР°С‚РѕСЂ РїРѕСЃС‚РѕСЏРЅРЅРѕРіРѕ СѓС‡Р°СЃС‚РєР° РїРѕСЃР»РµРґРѕРІР°С‚РµР»СЊРЅРѕСЃС‚Рё
            for s in f:
#СѓРґРѕСЃС‚РѕРІРµСЂСЏРµРјСЃСЏ, С‡С‚Рѕ РІСЃРµ СЌР»РµРјРµРЅС‚С‹ РїРѕСЃР»РµРґРѕРІР°С‚РµР»СЊРЅРѕСЃС‚Рё РЅР°С…РѕРґСЏС‚СЃСЏ РєР°Р¶РґС‹Р№ РЅР° СЃРІРѕРµР№ СЃС‚СЂРѕРєРµ ---------------------------------------------------
                for s1 in s.split(' '):             
                    for s2 in s1.split('\n'):
                        for s3 in s2.split('\t'):
                            for s4 in s3.split(','):
                                if (s4 != ''):
#----------------------------------------------------------------------------------------------------------------------------------------
                                    n+=1
                                    if n==1:
                                        el_1 = int(s4)
                                    if n>1:
                                        el_2=int(s4)
                                        if el_2==el_1:
                                            if region==0: # РїРѕРєР°Р·Р°С‚РµР»СЊ С‚РѕРіРѕ, С‡С‚Рѕ РјС‹ С‚РѕР»СЊРєРѕ РІРѕС€Р»Рё РІ РїРѕСЃС‚РѕСЏРЅРЅС‹Р№ СѓС‡Р°СЃС‚РѕРє
                                                count+=2
                                            if region > 0: #РїРѕРєР°Р·Р°С‚РµР»СЊ, С‡С‚Рѕ РјС‹ РґРІРёР¶РµРјСЃСЏ РїРѕ РїРѕСЃС‚РѕСЏРЅРЅРѕРјСѓ СѓС‡Р°СЃС‚РєСѓ
                                                count+=1
                                            region+=1
                                        else:      #РІС‹С€Р»Рё РёР· РїРѕСЃС‚РѕСЏРЅРЅРѕРіРѕ СѓС‡Р°СЃС‚РєР°
                                            region=0
                                        el_1=el_2                
            f.close()
            return 0, count
        else:
            print ("File is empty!") #РІС‹РІРѕРґ, РµСЃР»Рё С„Р°Р№Р» РїСѓСЃС‚РѕР№
            return -2,0
    except FileNotFoundError:   #С„Р°Р№Р» РІРѕРѕР±С‰Рµ РЅРµ Р±С‹Р» РЅР°Р№РґРµРЅ
        print ("File wasn't found!")
        return -2, 0
#----------------------------------------------------------------------------------------------------------------------------------------
def main():
    rez=0
    err=0
    print ("Enter the name of your file") #РїСЂРѕСЃРёРј РїРѕР»СЊР·РѕРІР°С‚РµР»СЏ РІРІРµСЃС‚Рё РёРјСЏ С„Р°Р№Р»Р°
    err,rez=Amount_of_elements_in_constant_regions(input() +'.txt') #РІС‹Р·С‹РІР°РµРј С„СѓРЅРєС†РёСЋ РїРѕРґСЃС‡РµС‚Р° РєРѕР»-РІР° СЌР»РµРјРµРЅС‚РѕРІ РІ РїРѕСЃС‚РѕСЏРЅРЅС‹С… СѓС‡Р°СЃС‚РєР°С… РїРѕСЃР»РµРґРѕРІР°С‚РµР»СЊРЅРѕСЃС‚Рё
    if err:
        print("ERROR!")
    else:
        print("Amount of elements in constant regions = ", rez)
#----------------------------------------------------------------------------------------------------------------------------------------
main()

